Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [9]:
x=pd.Series([4, 8, 15, 16, 23,42])

In [11]:
print(x)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [6]:
l=[12,34,54,656,7,6,87,8,9,8]

In [7]:
pd.Series(l)

0     12
1     34
2     54
3    656
4      7
5      6
6     87
7      8
8      9
9      8
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data:

Then, print the DataFrame.

In [15]:
data={
    "Name": ["Alice","Bob","Claire"],
    "Age": [25,30,27],
    "Gender": ["Female","Male","Female"]
}

In [23]:
pd.DataFrame(data)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In Pandas, a DataFrame is a two-dimensional, tabular data structure that is designed to store and manipulate data in a way that is similar to a spreadsheet or a SQL table.

A Pandas Series is a 1D array of data, but a single-column DataFrame is a 2D table with one column. The main distinction between the two is this. For a single-column DataFrame, an index can be optional, but a Series has to have an index defined

In [26]:
df=pd.DataFrame(data)

In [27]:
print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [33]:
type(df)

pandas.core.frame.DataFrame

In [29]:
series=df["Age"]

In [30]:
print(series)

0    25
1    30
2    27
Name: Age, dtype: int64

In [31]:
type(series)

pandas.core.series.Series

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [35]:
list(df.columns)      #finding columns

['Name', 'Age', 'Gender']

In [37]:
df[df["Age"]>=26]     #filtering data

     Name  Age  Gender
1     Bob   30    Male
2  Claire   27  Female

In [38]:
df[["Age","Name"]]   #selecting columns

   Age    Name
0   25   Alice
1   30     Bob
2   27  Claire

In [41]:
df.dtypes     #types of data

Name      object
Age        int64
Gender    object
dtype: object

In [45]:
df.describe()   #describe int and float data except object(string)

             Age
count   3.000000
mean   27.333333
std     2.516611
min    25.000000
25%    26.000000
50%    27.000000
75%    28.500000
max    30.000000

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

DataFrame and Series are mutable in nature.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [47]:
names=pd.Series(["Sarthak","Kanha","Pw"])
cgpa=pd.Series([8.8,7.6,6.32])
age=pd.Series([18,21,19])

In [52]:
pd.DataFrame({"Name":names,"CGPA":cgpa,"Age":age})

      Name  CGPA  Age
0  Sarthak  8.80   18
1    Kanha  7.60   21
2       Pw  6.32   19